import React, { useState } from 'react';
import { Fade } from "react-reveal"
import Progress from './Progress';

const Vaccine = () => {
    const [progress, setProgress] = useState(false)
    const handleShow = () => {
        setProgress(!progress)
    }
    return (
        <div className="col-xs-12 col-sm-12 col-md-12 vac">


            <h4>
                وضعیت واکسن های کرونا در سراسر دنیا
                </h4>
            <Fade left duration={1500}>
                <div className="row vaccine">
                    <div className="boxVac">
                        <h6>
                            واکسن در مرحله پیش بالینی

                    </h6>
                        <div className="boxvac1 vac1">
                            <h5>
                                ۱۵۵
                            </h5>
                        </div>
                        <p>
                            واکسن­هایی که در مرحله آزمایش انسانی نیستند
                 </p>
                    </div>
                    <div className="boxVac">
                        <h6>
                            فاز اول
                    </h6>

                        <div className="boxvac1 vac2">
                            <h5>
                                ۳۹
                            </h5>
                        </div>
                        <p>
                            واکسن­هایی که در حال آزمایش دوز مصرف و ایمنی اولیه هستند
                </p>
                    </div>
                    <div className="boxVac">
                        <h6>
                            فاز دوم
                    </h6>
                        <div className="boxvac1 vac3">
                            <h5>
                                ۱۸
                            </h5>
                        </div>
                        <p>
                            واکسن­هایی که در حال آزمایش های ایمنی گسترده هستند
                 </p>
                    </div>
                    <div className="boxVac">
                        <h6>
                            فاز سوم
                    </h6>
                        <div className="boxvac1 vac4">
                            <h5>
                                ۱۱
                            </h5>

                        </div>
                        <p>
                            واکسن­هایی که در حال آزمایش های مقیاس بزرگ اثرسنجی هستند
                 </p>
                    </div>
                    <div className="boxVac">
                        <h6>
                            محدود
                    </h6>
                        <div className="boxvac1 vac5">
                            <h5>
                                ۶
                            </h5>

                        </div>
                        <p>
                            واکسن­هایی برای استفاده محدود و زودهنگام
                 </p>
                    </div>

                    <div className="boxVac">
                        <h6>
                            تایید شده
                </h6>
                        <div className="boxvac1 vac6">
                            <h5>
                                ۰
                            </h5>
                        </div>
                        <p>
                            واکسن­های تایید شده برای استفاده کامل
                 </p>
                    </div>
                </div>
            </Fade>

            <div>
                <hr />
                <div className="text-center">
                    {!progress ? <button className="btn btn-lg btn-dark" onClick={handleShow}>


                        نمایش لیست واکسن ها
</button> : null}
                </div>


                {progress ?
                    <Fade bottom>
                        <Progress />
                    </Fade>
                    : null}

                <hr />
                <Fade bottom duration={1000}>
                    <div className="col-xs-12 col-sm-12 col-md-12 proc">


                        <h4>
                            فرایند آزمایش واکسن
            </h4>
                        <p>
                            <span>
                                آزمایش پیش ­بالینی
                                :
                        </span>
                            دانشمندان واکسن را روی حیواناتی نظیر موش یا میمون آزمایش می­ کنند تا ببینند واکنش ایمنی ایجاد می ­کند یا خیر.
                </p>
                        <hr />
                        <p>
                            <span>
                                فاز اول آزمایش ایمنی:

                        </span>
                            دانشمندان واکسن را روی تعداد کمی از انسان­ها آزمایش می­کنند تا ایمنی و دوز آن را بسنجند و تحریک سیستم ایمنی به تایید برسد.
                    </p>
                        <hr />
                        <p>
                            <span>
                                فاز دوم آزمایش جامع:

                        </span>
                            دانشمندان واکسن را روی صدها نفر در گروه­های جداگانه، مثلا کودکان و افراد مسن، آزمایش می­کنند تا ببینند عملکرد آن متفاوت است یا خیر. این آزمایش بیشتر ایمنی و توانایی واکسن در تحریک سیستم ایمنی را می­سنجد. در ماه ژوئن، اداره ­ی کل خوراک و دارو آمریکا اظهار داشت واکسن ویروس کرونا باید دست کم از 50% از کسانی که واکسن زده ­اند محافظت کند تا موثر تلقی شود.
                    </p>
                        <hr />
                        <p>
                            <span>
                                فاز سوم:

                        </span>
                            آزمایش میزان کارآمدی: دانشمندان واکسن را روی هزاران نفر آزمایش می­کنند و منتظر می­ مانند ببینند چند نفر در مقایسه با داوطلبانی که مسکن دریافت کرده بودند آلوده می­ شوند. براساس این آزمایشات می­توان تعیین کرد واکسن قابلیت ایجاد مصونیت دربرابر ویروس کرونا را دارد یا خیر.
                    </p>
                        <hr />
                        <p>
                            <span>
                                تایید:

                        </span>
                            بازرسان هر کشور نتایج آزمایشات را بررسی می­کنند و تصمیم می­گیرند واکسن مورد تایید هست یا خیر. حین پاندمی، قبل از این­که واکسن به تایید رسمی برسد درموارد اضطراری مورد استفاده قرار می­گیرد.
                    </p>
                        <hr />
                        <p>
                            <span>
                                ترکیب مراحل:

                        </span>
                            یک روش دیگر برای تسریع فرایند تولید واکسن ترکیب مراحل است. مثلا، بعضی از واکسن­های ویروس کرونا در حال حاضر در فاز آزمایشی I/II هستند و برای اولین بار روی صدها نفر آزمایش شدند. (توجه داشته باشید که منبع خبری ما ترکیب مراحل I/II آزمایش را همان فاز اول و دوم تلقی می­کند).
                    </p>
                    </div>
                </Fade>
            </div>
        </div>
    );
}

export default Vaccine;